tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "robotsandpencils/made"
tap "versent/taps"
brew "act"
brew "anyenv"
brew "argocd"
brew "asdf"
brew "awscli", link: false
brew "bat"
brew "chezmoi"
brew "curl"
brew "exa"
brew "gh"
brew "git"
brew "git-secrets"
brew "grpcurl"
brew "jq"
brew "mysql@5.7", link: true
brew "peco"
brew "python@3.10"
brew "saml2aws"
brew "sops"
brew "starship"
brew "wget"
brew "yarn"
brew "yq"
brew "zsh"
brew "hashicorp/tap/terraform", link: false
cask "chromedriver"
