cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "asdf"
brew "bat"
brew "chezmoi"
brew "curl"
brew "difftastic"
brew "direnv"
brew "eza"
brew "gh"
brew "git"
brew "git-secrets"
brew "grpcurl"
brew "jnv"
brew "jq"
brew "lazygit"
brew "mysql"
brew "peco"
brew "procs"
brew "ripgrep"
brew "starship"
brew "tree"
brew "uv"
brew "volta"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"

cask "cleanshot"
cask "lookaway"
cask "docker-desktop"
cask "font-moralerspace"
cask "font-0xproto-nerd-font"
cask "raycast"
cask "warp"
cask "visual-studio-code"
cask "font-ricty-diminished"
cask "spotify"
cask "zen"

{{ if (eq .chezmoi.username "naoya7076") }}
brew "pnpm"
brew "aqua-voice"
brew "mise"

cask "android-file-transfer"
cask "thebrowsercompany-dia"
cask "claude"
cask "cursor"
cask "discord"
cask "heptabase"
cask "raindropio"
{{ end }}

{{ if (eq .chezmoi.username "naoya.shimizu") }}
cask "gather"
cask "lookaway"
cask "ngrok"
cask "proxyman"
cask "reactotron"
cask "secretive"
cask "tableplus"
cask "session-manager-plugin"

brew "aws/tap/copilot-cli"
brew "broot"
brew "cloc"
brew "graphviz"
brew "mysql-client"
brew "golang-migrate"
brew "tfenv"
{{ end }}
