cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "act"
brew "asdf"
brew "awscli", link: false
brew "bat"
brew "chezmoi"
brew "curl"
brew "difftastic"
brew "eza"
brew "gh"
brew "git"
brew "git-secrets"
brew "grpcurl"
brew "jnv"
brew "jq"
brew "peco"
brew "procs"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"

cask "chromedriver"
cask "raycast"
cask "warp"
cask "skitch"
cask "visual-studio-code"
cask "font-ricty-diminished"
cask "skitch"
cask "spotify"
cask "obsidian"

{{ if (eq .chezmoi.username "naoya7076") }}
tap "supabase/tap"

brew "supabase"
brew "pnpm"
brew "volta"

cask "cursor"
cask "raindropio"
cask "discord"
{{ end }}

{{ if (eq .chezmoi.username "naoya-shimizu") }}
tap "carvel-dev/carvel"
brew "ytt"
tap "hashicorp/tap"
tap "versent/taps"

brew "hashicorp/tap/terraform"
brew "awscli"
brew "saml2aws"
brew "argocd"
brew "sops"
brew "bitwarden-cli"
brew "diff-pdf"
brew "actionlint"
brew "libsodium"

cask "docker"
cask "android-studio"
cask "appium"
cask "appium-inspector"
cask "tableplus"
{{ end }}

{{ if (eq .chezmoi.username "naoya.shimizu") }}
cask "gather"
brew "mysql-client"
brew "golang-migrate"
{{ end }}
